quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
/*
 * ============================================================
 *  ESP32-S3-Zero Flowmeter (×3) → Firebase Realtime Database
 * ============================================================
 *
 * Hardware setup:
 *   - Waveshare ESP32-S3-Zero (4MB flash, USB-CDC serial)
 *   - MAX485 RS485 transceiver module
 *   - Flowmeter 1 (Modbus RTU, Slave ID 2, 9600 baud, 8N1)
 *   - Flowmeter 2 (Modbus RTU, Slave ID 3, 9600 baud, 8N1)
 *   - Flowmeter 3 (Modbus RTU, Slave ID 4, 9600 baud, 8N1)
 *
 *  Pinout (S3-Zero, mirrors Teerem):
 *    GPIO 4 — MAX485 RO  (RX)
 *    GPIO 5 — MAX485 DI  (TX)
 *    GPIO 6 — MAX485 DE+RE
 *    GPIO 21 — WS2812 onboard RGB LED (status indicator)
 *
 * Required libraries (configured in platformio.ini):
 *   - Firebase Arduino Client Library by Mobizt
 *
 * Data flow:
 *   ESP32-S3 → RS485 bus → Flowmeters (Modbus RTU) → Modbus class → Firebase RTDB
 *
 * Remote OTA:
 *   • ota::begin() устгана /devices/flowmeter_<mac> heartbeat + /commands stream
 *   • Дашбоардаас Ping/Reboot/Update команд хүлээж авна
 *   • Шинэ firmware-г GitHub releases-ээс татаж 2-slot OTA-р суулгана
 */

#include "secrets.h" // WiFi and Firebase credentials (not tracked in git)
#include "ota.h"     // Remote OTA + heartbeat (DEVICE_ID = flowmeter_<mac>)
#include <Arduino.h> // Arduino core library for ESP32
#include <Firebase_ESP_Client.h> // Firebase client library for ESP32
#include <WiFi.h>                // WiFi connectivity library
#include <addons/RTDBHelper.h>   // Firebase Realtime Database helper functions
#include <addons/TokenHelper.h>  // Firebase authentication token helper
#include <esp_task_wdt.h>        // ESP32 hardware watchdog timer library

// ========================== CONFIGURATION ==========================

namespace cfg {
// MAX485 RS485 transceiver pins
constexpr uint8_t DE_RE = 6;  // MAX485 RE+DE (HIGH = transmit, LOW = receive)
constexpr uint8_t RX_PIN = 4; // MAX485 RO  (Serial1 RX)
constexpr uint8_t TX_PIN = 5; // MAX485 DI  (Serial1 TX)

// Modbus slave addresses (3 flowmeters + 1 ultrasonic level transmitter)
constexpr uint8_t FM1_SLAVE = 2;  // Суларсан уусмал
constexpr uint8_t FM2_SLAVE = 3;  // Баян уусмал
constexpr uint8_t FM3_SLAVE = 4;  // Суларсан уусмал 2
constexpr uint8_t ULS_SLAVE = 1;  // Supmea ultrasonic level transmitter (Суларсан уусмал савны түвшин)
constexpr uint32_t BAUD = 9600;

// Modbus holding register addresses
constexpr uint16_t REG_FLOW_RATE = 0x0000; // Reg[00-01]: Flow rate (float BE)
constexpr uint16_t REG_TOTALIZER = 0x0003; // Reg[03-06]: int32 + float fraction
constexpr uint16_t REG_ULS_LEVEL = 0x2002; // Ultrasonic Level instantaneous (raw/1000 = m)
constexpr uint16_t REG_ULS_MOUNT = 0x2009; // Ultrasonic Mount Height — суурилуулалтын нийт өндөр (raw/1000 = m, W/R)

// Timing
constexpr uint32_t READ_INTERVAL_MS = 3000;        // Flow rate read interval (also tick rate)
constexpr uint32_t TOTALIZER_INTERVAL_MS = 60000;  // Totalizer уншилт — 1 минут тутамд
constexpr uint32_t WIFI_RETRY_MS = 10000;          // WiFi reconnect probe
constexpr uint32_t WDT_TIMEOUT_S = 30;             // Watchdog timeout
constexpr uint32_t RX_TMO = 100;                   // Modbus receive timeout (ms)
constexpr uint32_t MODBUS_RETRY_DELAY_MS = 50;     // Уншилт амжилтгүй болсон үед хүлээх хугацаа

// Auto-recovery thresholds
constexpr uint8_t MAX_CONSECUTIVE_READ_FAILS = 10;
constexpr uint8_t MAX_TOTAL_RECOVERY_FAILS = 20;

// Long-running stability:
// - Heap free 20KB-аас доош унавал тогтворгүй болохын өмнөхөн соft restart хийнэ
// - 24 цаг ажилласны дараа сэргэлтийн restart (heap fragmentation, TLS leak г.м.)
constexpr uint32_t MIN_FREE_HEAP_BYTES = 20480;     // 20KB threshold
constexpr uint32_t MAX_UPTIME_MS = 24UL * 60UL * 60UL * 1000UL;  // 24 цаг
constexpr uint32_t HEAP_LOG_INTERVAL_MS = 5UL * 60UL * 1000UL;   // 5 минут тутамд heap log

// Connectivity watchdog: WiFi эсвэл Firebase энэ хугацаанаас удаан унавал
// болзолгүй ESP.restart() хийж сэргэнэ. while(true)+WDT-д найдахгүй — TLS/auth
// гацсан "амьд атлаа чимээгүй" төлөвөөс гаргах гол хамгаалалт.
constexpr uint32_t MAX_OFFLINE_MS = 3UL * 60UL * 1000UL;          // 3 минут
} // namespace cfg

// Firebase Realtime Database paths (string literals — keep as macros)
#define FB_PATH_FM1_FLOW "/flow_system/flowmeter1/flow_rate"
#define FB_PATH_FM1_TOTAL "/flow_system/flowmeter1/totalizer"
#define FB_PATH_FM2_FLOW "/flow_system/flowmeter2/flow_rate"
#define FB_PATH_FM2_TOTAL "/flow_system/flowmeter2/totalizer"
#define FB_PATH_FM3_FLOW "/flow_system/flowmeter3/flow_rate"
#define FB_PATH_FM3_TOTAL "/flow_system/flowmeter3/totalizer"
#define FB_PATH_LAST_UPDATED "/flow_system/last_updated"

// ========================== RGB STATUS LED ==========================
// WS2812 on GPIO 21 (Waveshare ESP32-S3-Zero onboard).
//   SLOW_RED — WiFi / Modbus / Firebase аль нэг нь алдсан үед удаан анивчина
//              (500ms on / 500ms off → 1 Hz). Энэ логик хэвээр үлдсэн.
//   pulse()  — Firebase-д амжилттай upload болгонд нэг богино ногоон импульс
//              (~120ms). Modbus poll-ийн 1 Hz ритмтэй синхрон —
//              terminal-ийн "[Firebase] Updated" мөртэй яг адил хэмнэлтэй.
namespace led {
constexpr uint8_t PIN = 21;
constexpr uint8_t BRIGHTNESS = 60;
constexpr uint16_t SLOW_ON_MS = 500;  // улаан blink ON
constexpr uint16_t SLOW_OFF_MS = 500; // улаан blink OFF
constexpr uint16_t PULSE_MS = 120;    // нэг ногоон импульсийн үргэлжлэх хугацаа

inline void writeRGB(uint8_t r, uint8_t g, uint8_t b) {
  // Энэ board-ийн WS2812 чип нь R/G сувгуудыг солиод эмиттэр-лж байна
  // (rgbLedWrite-ийн GRB conversion нь зарим S3-Zero batch-д таарахгүй).
  // Тиймээс r ба g-г солиод дамжуулна — дуудлагын талд "red"/"green"
  // гэсэн утга хэвээр.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  rgbLedWrite(PIN, g, r, b);
#else
  neopixelWrite(PIN, g, r, b);
#endif
}

inline uint8_t scale(uint8_t v) { return (uint16_t(v) * BRIGHTNESS) / 255; }

enum Mode { OFF, SLOW_RED };
// Boot үед өгөгдөл хараахан явуулаагүй учир улаан анивчиж эхэлнэ.
// Эхний амжилттай upload-аас хойш OFF болж ногоон pulse-ээр л асна.
Mode mode = SLOW_RED;
unsigned long nextToggle = 0;
unsigned long pulseOffAt = 0;
bool on = false;

void begin() { writeRGB(0, 0, 0); }

// Background blink mode. OFF = no blink (зөвхөн pulse-аар асаана).
void setMode(Mode m) {
  if (m == mode)
    return;
  mode = m;
  on = false;
  nextToggle = millis();
  if (m == OFF)
    writeRGB(0, 0, 0);
}

// One-shot green pulse — амжилттай upload болгонд дуудагдана.
// Аливаа background blink-ийг түр давж ногоон гэрэлтүүлнэ.
void pulse() {
  pulseOffAt = millis() + PULSE_MS;
  writeRGB(0, scale(255), 0);
}

// Non-blocking driver — ledTask-аас ~50 Hz-ийн давтамжтай дуудагдана.
void update() {
  unsigned long now = millis();

