quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
  // Ногоон импульс идэвхтэй бол blink-ийг түр зогсооно.
  if (pulseOffAt) {
    if (now < pulseOffAt)
      return;
    pulseOffAt = 0;
    writeRGB(0, 0, 0);
    on = false;
    nextToggle = now; // blink фазыг цэвэрхэн restart
  }

  if (mode == OFF)
    return;

  if (now < nextToggle)
    return;
  if (on) {
    writeRGB(0, 0, 0);
    on = false;
    nextToggle = now + SLOW_OFF_MS;
  } else {
    writeRGB(scale(255), 0, 0); // SLOW_RED
    on = true;
    nextToggle = now + SLOW_ON_MS;
  }
}
} // namespace led

// LED task — pinned to core 0 so Modbus / Firebase blocking on core 1 (where
// the Arduino loop runs) can't stall the blink cadence.
void ledTask(void *) {
  for (;;) {
    led::update();
    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

// ========================== MODBUS CLASS =========================
// Teerem firmware-тэй ижил Modbus pattern. readFloat / readTotalizer нь
// flowmeter-ийн ашигладаг хоёр гол функц. recover() нь UART buffer-ийг
// цэвэрлэж Serial1-г restart хийдэг.
class Modbus {
public:
  void begin() {
    pinMode(cfg::DE_RE, OUTPUT);
    digitalWrite(cfg::DE_RE, LOW);
    Serial1.begin(cfg::BAUD, SERIAL_8N1, cfg::RX_PIN, cfg::TX_PIN);
  }

  void recover() {
    // 1. UART-ыг бүрэн салгах
    Serial1.end();

    // 2. MAX485-ийг хүчээр RX горимд оруулна — TX drive-аа тавих
    pinMode(cfg::DE_RE, OUTPUT);
    digitalWrite(cfg::DE_RE, LOW);
    delay(100);

    // 3. RX шугамыг түр INPUT_PULLUP болгож idle (logical high) болгоно.
    //    Энэ нь зарим тохиолдолд "stuck" болсон transceiver-ийг сэргээдэг.
    pinMode(cfg::RX_PIN, INPUT_PULLUP);
    delay(50);

    // 4. UART-г дахин эхлүүлэх
    Serial1.begin(cfg::BAUD, SERIAL_8N1, cfg::RX_PIN, cfg::TX_PIN);
    delay(20);

    // 5. RX буфер цэвэрлэх
    while (Serial1.available())
      Serial1.read();
  }

  // Big-Endian 16-bit unsigned register (ultrasonic level register 0x2002)
  bool readShort(uint8_t slave, uint16_t addr, uint16_t &out) {
    uint8_t rx[7];
    if (!readRegs(slave, addr, 1, rx))
      return false;
    out = ((uint16_t)rx[3] << 8) | rx[4];
    return true;
  }

  // Big-Endian 32-bit IEEE 754 float (flow rate)
  bool readFloat(uint8_t slave, uint16_t addr, float &out) {
    uint8_t rx[9];
    if (!readRegs(slave, addr, 2, rx))
      return false;
    uint32_t raw = (uint32_t)rx[3] << 24 | (uint32_t)rx[4] << 16 |
                   (uint32_t)rx[5] << 8 | rx[6];
    memcpy(&out, &raw, 4);
    return true;
  }

  // Урсгал хэмжигч totalizer — 4 register (8 byte):
  // [0..3]  UINT32 BE = бүхэл хэсэг
  // [4..7]  Float BE  = бутархай хэсэг
  // Нийт нь: float (бүхэл + бутархай) cubic meter.
  bool readTotalizer(uint8_t slave, uint16_t addr, float &out) {
    uint8_t rx[13];
    if (!readRegs(slave, addr, 4, rx))
      return false;
    uint32_t intPart = ((uint32_t)rx[3] << 24) | ((uint32_t)rx[4] << 16) |
                       ((uint32_t)rx[5] << 8)  |  (uint32_t)rx[6];
    uint32_t fracRaw = ((uint32_t)rx[7] << 24) | ((uint32_t)rx[8] << 16) |
                       ((uint32_t)rx[9] << 8)  |  (uint32_t)rx[10];
    float fracPart;
    memcpy(&fracPart, &fracRaw, 4);
    out = (float)((double)intPart + (double)fracPart);
    return true;
  }

private:
  bool readRegs(uint8_t slave, uint16_t addr, uint8_t regCnt, uint8_t *rx) {
    while (Serial1.available())
      Serial1.read();

    uint8_t req[8] = {slave,        0x03,    uint8_t(addr >> 8),
                      uint8_t(addr), 0,       regCnt,
                      0,             0};
    uint16_t c = crc16(req, 6);
    req[6] = c & 0xFF;
    req[7] = c >> 8;

    send(req, sizeof(req));

    const uint8_t respLen = 5 + regCnt * 2;
    if (!receive(rx, respLen))
      return false;
    if (rx[0] != slave || rx[1] != 0x03 || rx[2] != regCnt * 2)
      return false;
    if (crc16(rx, respLen - 2) !=
        uint16_t(rx[respLen - 2] | (rx[respLen - 1] << 8)))
      return false;
    return true;
  }

  static uint16_t crc16(const uint8_t *buf, size_t len) {
    uint16_t c = 0xFFFF;
    for (size_t i = 0; i < len; i++) {
      c ^= buf[i];
      for (int b = 0; b < 8; b++)
        c = (c & 1) ? (c >> 1) ^ 0xA001 : c >> 1;
    }
    return c;
  }

  void send(const uint8_t *data, size_t len) {
    digitalWrite(cfg::DE_RE, HIGH);
    delayMicroseconds(50);          // DE өндөр болсны дараа драйвер идэвхжих хугацаа
    Serial1.write(data, len);
    Serial1.flush();                // TX register-г бүрэн хоослох
    // 9600 baud дээр нэг байт ≈ 1.04ms. flush() дууссаны дараа MAX485 шугам
    // тогтворжих хүртэл хүлээж DE/RE-г салгана — өмнө нь 100µs нь хэт богино
    // байсан тул сүүлийн bit таслагдаж slave хариу өгөхгүй болж байсан.
    delayMicroseconds(1200);
    digitalWrite(cfg::DE_RE, LOW);
    delayMicroseconds(200);         // RX горим идэвхжих, bus settle
  }

  bool receive(uint8_t *buf, size_t want) {
    size_t got = 0;
    unsigned long start = millis();
    while (millis() - start < cfg::RX_TMO && got < want) {
      if (Serial1.available())
        buf[got++] = Serial1.read();
    }
    return got == want;
  }
};

Modbus modbus;

// ========================== GLOBAL OBJECTS ==========================

FirebaseData fbData; // Firebase data object for storing request/response data
FirebaseAuth fbAuth; // Firebase authentication credentials holder
FirebaseConfig fbConfig; // Firebase configuration settings holder

unsigned long lastReadTime = 0;      // Timestamp of last flow rate reading (ms)
unsigned long lastTotalizerReadTime = 0; // Сүүлд totalizer уншсан агшин (ms)
unsigned long lastWifiCheck = 0;     // Timestamp of last WiFi check (ms)
unsigned long lastHeapLogTime = 0;   // Сүүлд heap-н хэмжээг log хийсэн агшин
bool firebaseReady = false;          // Firebase auth complete flag

// Totalizer утга 1 минутад нэг л шинэчлэгдэх тул хооронд нь cache-д хадгална.
// Анхны утга 0.0 нь Firebase upload-д орохгүй — `cachedTotal*Valid` flag
// эхний амжилттай уншилтын дараа л true болж, шинэчлэлт эхэлнэ.
float cachedTotal1 = 0.0f, cachedTotal2 = 0.0f, cachedTotal3 = 0.0f;
bool  cachedTotal1Valid = false, cachedTotal2Valid = false, cachedTotal3Valid = false;

// Ultrasonic mount height (суурилуулалтын нийт өндөр, рег. 0x2009) — boot дээр
// нэг л удаа уншиж, Firebase-д нэг удаа нийтэлнэ. Дашбоард савны дээд хязгаарт
// (data-max) үүнийг ашиглана — HTML дээр гараар тохируулах шаардлагагүй.
float ulsMountM = 0.0f;
bool  ulsMountKnown = false;
bool  ulsMountSent = false;

// Firebase upload backoff — prevents auth rate-limit storms on failure
unsigned long fbNextAllowedAt = 0; // Next allowed upload timestamp
unsigned int fbFailStreak = 0;     // Consecutive upload failure count

// Modbus read failure recovery state
unsigned int consecutiveReadFails = 0; // Straight failed read cycles
unsigned int totalRecoveryAttempts = 0; // Recovery escalations since last success

// Connectivity watchdog state — салгагдсан агшнаас хэдий хугацаа өнгөрснийг хэмжинэ.
// 0 = одоо холбоотой (асуудалгүй).
unsigned long wifiDownSince = 0;    // WiFi салгагдсан агшин (ms)
unsigned long fbNotReadySince = 0;  // Firebase ready бус болсон агшин (ms, WiFi байгаа үед)

// ========================== WI-FI CONNECTION =========================

// WiFi event handler — auto-triggers reconnection on any disconnect event.
void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    break;
  default:
    break;
  }
}

