quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
// ========================== SETUP (RUNS ONCE AT BOOT)
// ==================================

/*
 * Arduino setup function — runs once when ESP32 powers on or resets.
 * Initializes serial ports, RS485 transceiver, WiFi, Firebase, and watchdog
 * timer.
 */
void setup() {
  Serial.begin(115200); // Initialize debug serial port at 115200 baud
  delay(300);           // Brief delay for USB-CDC serial to stabilize
  Serial.println("\n========= Flowmeter IoT (S3-Zero x3) =========");

  led::begin();
  // LED runs on its own core 0 task so Modbus / Firebase blocking calls
  // on core 1 (Arduino loop) never freeze the blink animation.
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  // Modbus class дотор pinMode + digitalWrite + Serial1.begin бүгдийг хийнэ
  modbus.begin();
  Serial.printf(
      "[Modbus] Initialized — Flowmeter 1: Slave %d, Flowmeter 2: Slave %d, "
      "Flowmeter 3: Slave %d\n",
      cfg::FM1_SLAVE, cfg::FM2_SLAVE, cfg::FM3_SLAVE);

  WiFi.onEvent(onWifiEvent); // Register auto-reconnect event handler BEFORE
                             // first connect
  wifiConnect();             // Connect to WiFi network
  firebaseInit();            // Initialize Firebase connection

  // Configure ESP32 hardware watchdog timer to reset the chip if code hangs
  esp_task_wdt_config_t wdtConfig = {
      .timeout_ms = cfg::WDT_TIMEOUT_S * 1000, // Timeout in milliseconds
      .idle_core_mask = 0,                // Don't watch idle tasks
      .trigger_panic = true};             // Reset ESP32 on timeout
  esp_task_wdt_reconfigure(&wdtConfig);   // Apply watchdog configuration
  esp_task_wdt_add(NULL); // Add current task to watchdog monitoring
  Serial.printf("[WDT] Watchdog started — %d second timeout\n",
                cfg::WDT_TIMEOUT_S);
}

// ========================== MAIN LOOP (RUNS REPEATEDLY) =================

/*
 * Arduino loop function — runs continuously after setup().
 * Reads both flowmeters via Modbus RTU and uploads values to Firebase.
 * Includes WiFi reconnection logic and watchdog timer reset.
 */
void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ---- Long-running stability watchdog ----
  // Heap fragmentation (Firebase TLS буфер, FirebaseJson allocation г.м.) удаан
  // ажиллах тусам хуримтлагдаж тогтворгүй болгож болзошгүй. 2 хамгаалалт:
  //   1) 5 минут тутам free heap-г log хийнэ — graphana/serial monitor дээр
  //      санах ой буурч буй эсэхийг харж болно.
  //   2) Free heap нь босгоос (20KB) доош унавал, эсвэл uptime 24 цаг хэтэрвэл
  //      cleaн restart хийж бүх ресурсыг чөлөөлнө. ESP.restart() нь
  //      крашгүй perezagruz хийдэг — Firebase, ota::loop хувилбаруудаас
  //      найдвартай. WiFi/Firebase setup() дээр дахин эхэлнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u bytes | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // ---- Connectivity watchdog ----
  // WiFi эсвэл Firebase нь cfg::MAX_OFFLINE_MS-ээс удаан салгагдвал цэвэр reboot.
  // Энэ нь сэргэлтийн гол баталгаа: WiFi буцаж ирэхэд эсвэл сенсор сэргэхэд
  // төхөөрөмж "бүр мөсөн алга" болохгүй, заавал өөрөө сэргэнэ. Firebase.ready()-г
  // энд цикл бүрт дуудах нь token-refresh-ийг тасралтгүй ажиллуулж бас тустай.
  if (WiFi.status() == WL_CONNECTED) {
    wifiDownSince = 0;
  } else if (wifiDownSince == 0) {
    wifiDownSince = now;
  } else if (now - wifiDownSince >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] WiFi offline too long — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() == WL_CONNECTED && !Firebase.ready()) {
    if (fbNotReadySince == 0) {
      fbNotReadySince = now;
    } else if (now - fbNotReadySince >= cfg::MAX_OFFLINE_MS) {
      Serial.println("[Watchdog] Firebase not ready too long — clean restart");
      Serial.flush();
      delay(200);
      ESP.restart();
    }
  } else {
    fbNotReadySince = 0;
  }

  // Fallback WiFi polling — onWifiEvent/setAutoReconnect handle most cases,
  // but we retry manually if the connection has been down for cfg::WIFI_RETRY_MS.
  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    wifiConnect();
  }

  // Rate limit: 2 секунд тутамд нэг cycle (READ_INTERVAL_MS)
  if (now - lastReadTime < cfg::READ_INTERVAL_MS)
    return;
  lastReadTime = now;

  // Цикл бүрд flow-cycle эсвэл totalizer-cycle гэсэн 2 төрлийн нэг нь явна.
  // Modbus bus-н ачааллыг бууруулж, "хоёуланг нь зэрэг уншихгүй" гэсэн
  // шаардлагыг хангахын тулд totalizer-ийг тусад нь minute-тэй уншина.
  // Boot-ийн дараа нэг удаа totalizer-ийг шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  // Энэ цикл-д Firebase upload руу очих утгууд
  float flow1 = 0.0f, flow2 = 0.0f, flow3 = 0.0f;
  float total1 = 0.0f, total2 = 0.0f, total3 = 0.0f;
  bool okFlow1 = false, okFlow2 = false, okFlow3 = false;
  bool okTotal1 = false, okTotal2 = false, okTotal3 = false;

  if (totalizerCycle) {
    // ---- Totalizer cycle: 3 flowmeter-ийн totalizer-ийг л унших ----
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    okTotal1 = readTotalizerRetry(cfg::FM1_SLAVE, cfg::REG_TOTALIZER, total1);
    if (okTotal1) { cachedTotal1 = total1; cachedTotal1Valid = true; }
    delay(50);

    okTotal2 = readTotalizerRetry(cfg::FM2_SLAVE, cfg::REG_TOTALIZER, total2);
    if (okTotal2) { cachedTotal2 = total2; cachedTotal2Valid = true; }
    delay(50);

    okTotal3 = readTotalizerRetry(cfg::FM3_SLAVE, cfg::REG_TOTALIZER, total3);
    if (okTotal3) { cachedTotal3 = total3; cachedTotal3Valid = true; }
    delay(50);

    Serial.printf("[Totalizer] FM1:%.3f(%d) FM2:%.3f(%d) FM3:%.3f(%d) m3\n",
                  total1, okTotal1, total2, okTotal2, total3, okTotal3);
  } else {
    // ---- Flow cycle: 3 flowmeter-ийн flow rate-ийг л унших ----
    okFlow1 = readFloatRetry(cfg::FM1_SLAVE, cfg::REG_FLOW_RATE, flow1);
    delay(50);
    okFlow2 = readFloatRetry(cfg::FM2_SLAVE, cfg::REG_FLOW_RATE, flow2);
    delay(50);
    okFlow3 = readFloatRetry(cfg::FM3_SLAVE, cfg::REG_FLOW_RATE, flow3);
    delay(50);

