quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
    Serial.printf("[Flow] FM1:%.3f(%d) FM2:%.3f(%d) FM3:%.3f(%d) m3/h\n",
                  flow1, okFlow1, flow2, okFlow2, flow3, okFlow3);
  }

  // ---- Read Ultrasonic Level Transmitter (Slave ID 1) ----
  // Register 0x2002 = Level instantaneous (uint16, decimal=3 → /1000 = m).
  // Level нь нэг л register учир хоёр төрлийн цикл-д унших — bus-д бараг
  // ачаалал өгөхгүй.
  uint16_t levelRaw = 0;
  bool okLevel = readShortRetry(cfg::ULS_SLAVE, cfg::REG_ULS_LEVEL, levelRaw);
  float ulsLevel = okLevel ? (levelRaw / 1000.0f) : 0.0f;

  if (okLevel)
    Serial.printf("[ULS] Level: %.3f m\n", ulsLevel);
  else
    Serial.println("[ULS] Read failed");

  // Mount height-г нэг л удаа (амжилттай болтол cycle бүрт оролдоно) уншина.
  if (!ulsMountKnown) {
    uint16_t mountRaw = 0;
    if (readShortRetry(cfg::ULS_SLAVE, cfg::REG_ULS_MOUNT, mountRaw) && mountRaw > 0) {
      ulsMountM = mountRaw / 1000.0f;
      ulsMountKnown = true;
      Serial.printf("[ULS] Mount height: %.3f m\n", ulsMountM);
    }
  }

  // ---- Track read failures and escalate recovery if needed ----
  bool anyReadOk = okFlow1 || okFlow2 || okFlow3 ||
                   okTotal1 || okTotal2 || okTotal3 || okLevel;
  if (anyReadOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_READ_FAILS) {
      recoverModbusBus();
    }
  }

  // WiFi сүлжээ байхгүй бол улаан анивчина — Firebase ямартай ч ажиллахгүй.
  if (WiFi.status() != WL_CONNECTED) {
    led::setMode(led::SLOW_RED);
    return;
  }

  // ---- Upload to Firebase (single multi-path PATCH → 1 HTTP request) ----
  // 6-7 setFloat дуудлагыг нэг updateNode болгож хувиргав. RS485 + 3 sensor
  // дуусаад нэг л HTTPS round-trip — loop iteration ~1.5s → ~0.7s болсон.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] Ready");
    ota::begin(&fbData); // DEVICE_ID register + командын stream нээх
  }

  FirebaseJson json;
  bool anyWrite = false;

  if (totalizerCycle) {
    // Зөвхөн totalizer-уудыг шинэчилнэ. Амжилтгүй уншилт бол cache-ийг
    // өмнөх утга дээр үлдээгээд бичихгүй (хуучин зөв утгыг 0-р дарж болохгүй).
    if (okTotal1) { json.set("flowmeter1/totalizer", cachedTotal1); anyWrite = true; }
    if (okTotal2) { json.set("flowmeter2/totalizer", cachedTotal2); anyWrite = true; }
    if (okTotal3) { json.set("flowmeter3/totalizer", cachedTotal3); anyWrite = true; }
  } else {
    if (okFlow1) { json.set("flowmeter1/flow_rate", liveValue(flow1, lvFm1)); anyWrite = true; }
    if (okFlow2) { json.set("flowmeter2/flow_rate", liveValue(flow2, lvFm2)); anyWrite = true; }
    if (okFlow3) { json.set("flowmeter3/flow_rate", liveValue(flow3, lvFm3)); anyWrite = true; }
  }
  if (okLevel)  { json.set("level_sensor/level", liveValue(ulsLevel, lvLevel)); anyWrite = true; }
  // Mount height-г нэг удаа нийтэлнэ (амжилттай upload болтол дахин оролдоно).
  if (ulsMountKnown && !ulsMountSent) { json.set("level_sensor/mount_height", ulsMountM); anyWrite = true; }

  bool uploadOk = false;
  if (!anyWrite) {
    // Modbus бүх 3 sensor энэ cycle-д хариу өгсөнгүй → улаан
    led::setMode(led::SLOW_RED);
  } else {
    json.set("last_updated", (int)(millis() / 1000));

    if (Firebase.RTDB.updateNode(&fbData, "/flow_system", &json)) {
      Serial.println("[Firebase] Updated");
      fbOnSuccess();
      led::setMode(led::OFF);
      led::pulse(); // upload бүрд нэг ногоон импульс — terminal-той synchron
      uploadOk = true;
      if (ulsMountKnown) ulsMountSent = true; // mount height нийтлэгдсэн

    } else {
      Serial.printf("[Firebase] update ERROR: %s\n", fbData.errorReason().c_str());
      fbOnFailure();
      led::setMode(led::SLOW_RED);
    }
  }

  // OTA heartbeat + progress publish + command stream tick.
  // Firebase ready болсон бөгөөд upload амжилттай эсэхийг дамжуулна —
  // self-test шалгуурт ашиглана.
  ota::loop(&fbData, uploadOk);
}
